from pydantic import dataclasses


class t:
    student = "Я студент 🎓"
    teacher = "Я преподаватель 🧑‍🏫"
    return_back = "Назад ↩️"
    save_form = "Сохранить форму ✔️"
    leave_form = "Уйти с формы ✖️"
    skip = "Пропустить ➡️"
    question_deanery = "Вопрос деканату 📣"
    question_department = "Вопрос кафедре 🏫"
    account = "Аккаунт 👤"
    science = "Наука 🔬"
    championships = "Чемпионаты и практики 🏆"
    schedules =  "Расписание отделов ⌛️"
    diplomas = "Дипломы и диссертации 📚"
    scholarships = "Стипендии и гранты 💸"
